VibeCoding-tw/esp32c3-launcher/src/main.cpp
// 包含必要的庫
#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>               // Web Server
#include <ArduinoOTA.h>              // 透過網路進行韌體更新
#include <ESPmDNS.h>                 // 區域網路名稱解析
#include "esp_ota_ops.h"             // OTA 相關操作
#include "esp_partition.h"           // 分區表操作
#include "esp_task_wdt.h"            // Watchdog Timer 函式庫
#include "esp32c3_gpio.h"            // 此處定義了 GPIO 腳位
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#include <Preferences.h>             // 用於儲存 Wi-Fi 憑證及馬達參數
#include <freertos/FreeRTOS.h>       // 繼續使用 FreeRTOS 任務功能
#include <freertos/task.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <WiFiUdp.h>
#include <WebSocketsServer.h>

// --- 全域變數 ---
String globalHostname;               // 基於 MAC 位址的唯一 Hostname
#define CURRENT_VERSION "2026.04.21.12" 
WebServer server(80);                
WebSocketsServer webSocket(81);      
WiFiUDP udp;                         
const unsigned int UDP_PORT = 4210;  
volatile bool isUpdating = false;    
TaskHandle_t updateTaskHandle = NULL;

const int PWM_FREQ = 20000;
const int PWM_RESOLUTION = 8;
const int PWM_MAX = 255;
const int LEDC_CH_A1 = 0;
const int LEDC_CH_A2 = 1;
const int LEDC_CH_B1 = 2;
const int LEDC_CH_B2 = 3;

typedef struct {
    uint16_t controlTimeoutT; 
    uint16_t controlTimeoutS; 
    int pwmEffectiveLimitT; 
    int rampAccelStepT; 
    int pwmStartKickT; 
    int pwmEffectiveLimitS; 
    int rampAccelStepS; 
    int pwmStartKickS;
    uint8_t autoUpdateEnabled; 
    uint8_t padding;           
} MotorConfig_t;

Preferences preferences;             
MotorConfig_t motorConfig;           

volatile unsigned long lastControlTime = 0; 
volatile int targetSpeedT = 0;             
volatile int currentSpeedT = 0;            
volatile int targetSpeedS = 0;             
volatile int currentSpeedS = 0;            
const int RAMP_INTERVAL_MS = 10;           
unsigned long lastRampTime = 0;

const char* CONFIG_SERVICE_UUID  = "6e400001-b5a3-f393-e0a9-e50e24dcca9e"; 
const char* MOTOR_SERVICE_UUID   = "4fafc201-1fb5-459e-8fcc-c0ffee00dead"; 
#define SSID_CHAR_UUID          "6e400002-b5a3-f393-e0a9-e50e24dcca9e" 
#define PASS_CHAR_UUID          "6e400003-b5a3-f393-e0a9-e50e24dcca9e" 
#define MOTOR_CONTROL_CHAR_UUID "4fafc202-1fb5-459e-8fcc-c0ffee01feed" 
#define MOTOR_CONFIG_CHAR_UUID  "4fafc203-1fb5-459e-8fcc-c0ffee02dead" 

BLEServer *pServer = NULL;
BLECharacteristic *pControlCharacteristic = NULL;
BLECharacteristic *pSsidCharacteristic = NULL;
BLECharacteristic *pPassCharacteristic = NULL;
BLECharacteristic *pMotorConfigCharacteristic = NULL; 
String ble_ssid;
String ble_pass;
bool wifi_config_received = false;
volatile bool should_restart_advertising = false;
bool servicesStarted = false;
float batteryVoltage = 0.0;          
const float ADC_VOLT_REF = 3.1;      
const float DIVIDER_RATIO = 2.0;     
unsigned long lastBatteryCheck = 0;
const int BATT_CHECK_INTERVAL = 500; 

// --- 函式前置宣告 ---
void loadMotorConfig();
void saveMotorConfig();
void performGitHubCloudUpdate();
void checkAndPerformAutoUpdate();
void handleRoot();
void handleJoystick();
void onWsEvent(uint8_t num, WStype_t type, uint8_t * payload, size_t length);
void checkUdpControl();
void vTaskUpdate(void *pvParameters);
void setupWebServer();
void setupMdnsOtaSta();
void connectToSavedWiFi();
void generateHostname();
void motorRampTask();
void updateBatteryVoltage();
void setMotorPwm(int t, int s);

// --- HTML 網頁內容 ---
static const char* JOYSTICK_PAGE_HTML = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Vibe Racer 控制 (搖桿)</title>
    <script src="https://cdn.tailwindcss.com"></script>
    <style>
        body { background: #0f172a; color: #f9fafb; font-family: system-ui; display: flex; justify-content: center; align-items: center; min-height: 100vh; margin: 0; padding: 1rem; }
        .container { max-width: 400px; width: 100%; padding: 20px; }
        #joystick { 
            position: relative; width: 100%; padding-top: 100%; margin: 0 auto; 
            border-radius: 50%; background: linear-gradient(145deg, #2d3748, #1a202c); 
            box-shadow: 10px 10px 20px #171d26, -10px -10px 20px #273142, inset 0 0 10px rgba(0,0,0,0.5);
            touch-action: none;
        }
        #joystick-thumb {
            position: absolute; width: 70px; height: 70px; top: 50%; left: 50%;
            transform: translate(-50%, -50%); border-radius: 50%; background: #4f46e5;
            box-shadow: 0 0 15px #4f46e5, inset 0 0 10px #7c3aed;
        }
    </style>
</head>
<body class="p-4">
    <div class="container bg-gray-800 rounded-xl shadow-2xl">
        <h1 class="text-3xl font-extrabold text-center text-indigo-400 mb-2">Vibe Racer</h1>
        <p class="text-center text-[10px] mb-4 text-gray-500 uppercase tracking-widest">模式: 虛擬搖桿 | <a href="/" class="text-indigo-400 underline">D-Pad</a></p>
        <div class="bg-gray-900/50 rounded-lg p-3 mb-6 border border-gray-700">
            <div class="flex justify-between items-center text-left">
                <div><p class="text-[10px] text-gray-500 uppercase">電池</p><p class="text-xl font-mono font-bold text-green-400"><span id="val_v">0.00</span>V</p></div>
                <div class="text-right"><p class="text-[10px] text-gray-500 uppercase">即時</p><p class="text-sm font-mono text-indigo-300">T:<span id="val_rt">0</span> S:<span id="val_rs">0</span></p></div>
            </div>
        </div>
        <div id="joystick" class="mb-6"><div id="joystick-thumb"></div></div>
        <p id="status" class="text-center text-sm font-bold text-green-400 mb-4 uppercase tracking-widest">● 靜止 ●</p>
        <div class="p-4 border-t border-gray-700 text-center text-[10px] text-gray-500 flex justify-between items-center">
            <span><a href="/update_factory" class="hover:text-indigo-400">韌體維修中心</a> | Ver %VERSION%</span>
            <span id="conn_type" class="opacity-50">🌐</span>
        </div>
    </div>
    <script>
        const joystick = document.getElementById('joystick'); const thumb = document.getElementById('joystick-thumb');
        const valVEl = document.getElementById('val_v'); const valRTEl = document.getElementById('val_rt'); const valRSELEl = document.getElementById('val_rs');
        const statusEl = document.getElementById('status');
        const maxRadius = joystick.clientWidth/2;
        let isDragging = false, lastMotorT = 0, lastMotorS = 0;
        let ws = new WebSocket(`ws://${location.hostname}:81`);
        const connType = document.getElementById('conn_type');
        ws.onopen = () => connType.textContent = '⚡';
        ws.onclose = () => connType.textContent = '🌐';
        
        function send(t,s) { 
            if(ws.readyState===1) ws.send(`${t},${s}`); 
            else fetch(`/control?t=${t}&s=${s}`); // HTTP 回退機制
        }
        function fetchTelemetry() { fetch('/control?t='+lastMotorT+'&s='+lastMotorS).then(r=>r.json()).then(d=>{ valVEl.textContent=d.v.toFixed(2); valRTEl.textContent=d.rt; valRSELEl.textContent=d.rs; }); }
        setInterval(fetchTelemetry, 1000);

        function stop() { isDragging = false; thumb.style.left = '50%'; thumb.style.top = '50%'; send(0,0); statusEl.textContent="● 靜止 ●"; }
        joystick.addEventListener('touchstart', e => { isDragging=true; });
        document.addEventListener('touchmove', e => {
            if(!isDragging) return; e.preventDefault();
            const rect = joystick.getBoundingClientRect();
            let ox = e.touches[0].clientX - (rect.left+maxRadius);
            let oy = e.touches[0].clientY - (rect.top+maxRadius);
            const ds = Math.sqrt(ox*ox+oy*oy); if(ds>maxRadius){ const an=Math.atan2(oy,ox); ox=maxRadius*Math.cos(an); oy=maxRadius*Math.sin(an); }
            thumb.style.left=`${maxRadius+ox}px`; thumb.style.top=`${maxRadius+oy}px`;
            lastMotorS = Math.round((ox/maxRadius)*255); lastMotorT = Math.round((-oy/maxRadius)*255);
            send(lastMotorT, lastMotorS);
            statusEl.textContent="● 運行中 ●";
        }, {passive:false});
        document.addEventListener('touchend', stop);
    </script>
</body>
</html>)rawliteral";

static const char* DPAD_PAGE_HTML = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Vibe Racer 控制 (D-Pad)</title>
    <script src="https://cdn.tailwindcss.com"></script>
    <style>
        body { background: #0f172a; color: #f9fafb; font-family: system-ui; display: flex; justify-content: center; align-items: center; min-height: 100vh; margin: 0; padding: 1rem; }
        .btn-dpad { aspect-ratio: 1/1; border-radius: 16px; background: #1e293b; border: 1px solid rgba(255,255,255,0.1); display: flex; justify-content: center; align-items: center; cursor: pointer; transition: 0.1s; -webkit-tap-highlight-color: transparent; }
        .btn-dpad:active { background: #4f46e5; transform: scale(0.95); }
    </style>
</head>
<body class="p-4">
    <div class="container bg-gray-800 rounded-2xl shadow-2xl p-6 max-w-sm w-full">
        <h1 class="text-2xl font-bold text-center text-indigo-400 mb-6">Vibe Racer</h1>
        <div class="bg-gray-900/50 rounded-xl p-4 border border-gray-700 mb-8 flex justify-between">
            <div><p class="text-[10px] text-gray-500 uppercase">電池</p><p class="text-lg font-mono font-bold text-green-400"><span id="val_v">0.00</span>V</p></div>
            <div class="text-right"><p class="text-[10px] text-gray-500 uppercase">即時</p><p class="text-xs font-mono text-indigo-300">T:<span id="val_rt">0</span> S:<span id="val_rs">0</span></p></div>
        </div>
        <div class="grid grid-cols-3 gap-3 mb-10">
            <div></div><div class="btn-dpad" ontouchstart="mt(255,0)" ontouchend="sp()"><svg class="w-8 h-8" viewBox="0 0 24 24" fill="currentColor"><path d="M12 4l-8 8h16z"/></svg></div><div></div>
            <div class="btn-dpad" ontouchstart="mt(0,-255)" ontouchend="sp()"><svg class="w-8 h-8" viewBox="0 0 24 24" fill="currentColor"><path d="M4 12l8-8v16z"/></svg></div>
            <div class="btn-dpad bg-red-500/10" ontouchstart="sp()"><div class="w-3 h-3 bg-red-500 rounded-sm"></div></div>
            <div class="btn-dpad" ontouchstart="mt(0,255)" ontouchend="sp()"><svg class="w-8 h-8" viewBox="0 0 24 24" fill="currentColor"><path d="M20 12l-8-8v16z"/></svg></div>
            <div></div><div class="btn-dpad" ontouchstart="mt(-255,0)" ontouchend="sp()"><svg class="w-8 h-8" viewBox="0 0 24 24" fill="currentColor"><path d="M12 20l-8-8h16z"/></svg></div><div></div>
        </div>
        <div class="text-center text-[10px] text-gray-600 flex justify-between items-center px-2">
            <span><a href="/joystick" class="underline">切換至搖桿</a> | <a href="/update_factory" class="underline">維護中心</a> | Ver %VERSION%</span>
            <span id="conn_type" class="opacity-50">🌐</span>
        </div>
    </div>
    <script>
        let ws = new WebSocket(`ws://${location.hostname}:81`);
        const connType = document.getElementById('conn_type');
        ws.onopen = () => connType.textContent = '⚡';
        ws.onclose = () => connType.textContent = '🌐';
        function mt(t,s){ 
            if(ws.readyState===1) ws.send(`${t},${s}`); 
            else fetch(`/control?t=${t}&s=${s}`); // HTTP 回退機制
        }
        function sp(){ 
            if(ws.readyState===1) ws.send(`0,0`); 
            else fetch(`/control?t=0&s=0`); // HTTP 回退機制
        }
        setInterval(()=>{ fetch('/control?t=0&s=0').then(r=>r.json()).then(d=>{ document.getElementById('val_v').textContent=d.v.toFixed(2); document.getElementById('val_rt').textContent=d.rt; document.getElementById('val_rs').textContent=d.rs; }); }, 2000);
    </script>
</body>
</html>)rawliteral";

const char UPDATE_PAGE_HTML[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head><meta charset="UTF-8"><title>Updating...</title><script src="https://cdn.tailwindcss.com"></script></head>
<body class="bg-slate-900 text-white flex items-center justify-center min-h-screen">
    <div class="p-8 bg-slate-800 rounded-3xl shadow-2xl text-center">
        <h1 class="text-2xl font-bold text-indigo-400 mb-4">系統更新中...</h1>
        <p class="text-sm text-gray-400">正在下載韌體並釋放內存，請勿斷電。</p>
        <div class="mt-6 flex justify-center"><div class="animate-spin rounded-full h-10 w-10 border-4 border-indigo-500 border-t-transparent"></div></div>
        <p class="mt-8 text-xs text-gray-600">預計 40 秒後自動重啟並返回首頁</p>
    </div>
    <script>setTimeout(()=>location.href='/', 45000);</script>
</body>
</html>)rawliteral";

const char MAINTENANCE_PAGE_HTML[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head><meta charset="UTF-8"><title>Maintenance</title><script src="https://cdn.tailwindcss.com"></script></head>
<body class="bg-slate-900 text-white p-6 flex justify-center items-center min-h-screen">
    <div class="bg-slate-800 p-8 rounded-3xl shadow-2xl w-full max-w-md">
        <h1 class="text-2xl font-bold text-indigo-400 mb-6">維修與更新</h1>
        <div class="space-y-6">
            <div class="p-4 bg-slate-900 rounded-2xl flex justify-between items-center">
                <span>自動更新</span>
                <button onclick="location.href='/toggle_auto_update'" class="px-4 py-2 bg-indigo-600 rounded-xl text-xs font-bold uppercase">切換狀態</button>
            </div>
            <button onclick="if(confirm('啟動雲端更新？')) location.href='/update_github';" class="w-full p-4 bg-indigo-600 rounded-2xl font-bold shadow-lg">🚀 啟動 GitHub 雲端更新</button>
            <div class="pt-6 border-t border-slate-700 text-center"><a href="/" class="text-xs text-gray-500 underline">返回控制頁</a></div>
        </div>
    </div>
</body>
</html>)rawliteral";

