VibeCoding-tw/esp32c3-launcher/src/main.cpp
// --- BLE Callbacks ---
class MyServerCallbacks: public BLEServerCallbacks {
    void onConnect(BLEServer* p) { Serial.println("📡 BLE Connected."); }
    void onDisconnect(BLEServer* p) { Serial.println("📡 BLE Disconnected."); should_restart_advertising = true; }
};

class MyCharCallbacks: public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic* p) {
        std::string val = p->getValue();
        if (val.length() > 0) {
            String cmd = String(val.c_str());
            int idx = cmd.indexOf(',');
            if (idx > 0) { 
                targetSpeedT = cmd.substring(0, idx).toInt(); 
                targetSpeedS = cmd.substring(idx + 1).toInt(); 
                lastControlTime = millis(); 
            }
        }
    }
};

// [NEW] WiFi SSID 讀取/寫入回調
class WiFiSsidCallbacks: public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic* p) {
        std::string val = p->getValue();
        if (val.length() > 0) {
            ble_ssid = String(val.c_str());
            Serial.printf("BLE: Received SSID: %s\n", ble_ssid.c_str());
        }
    }
};

// [NEW] WiFi Password 讀取/寫入回調
class WiFiPassCallbacks: public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic* p) {
        std::string val = p->getValue();
        if (val.length() > 0) {
            ble_pass = String(val.c_str());
            Serial.println("BLE: Received Password. Saving WiFi config...");
            preferences.begin("wifi-config", false);
            preferences.putString("ssid", ble_ssid);
            preferences.putString("pass", ble_pass);
            preferences.end();
            Serial.println("✅ WiFi Config Saved. Restarting in 2s...");
            delay(2000);
            ESP.restart();
        }
    }
};

class MotorConfigCallbacks: public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic* p) {
        std::string rxValue = p->getValue();
        if (rxValue.length() == sizeof(MotorConfig_t)) {
            memcpy(&motorConfig, rxValue.data(), sizeof(MotorConfig_t));
            saveMotorConfig();
            Serial.println("✅ Motor Config updated via BLE.");
            p->setValue((uint8_t*)&motorConfig, sizeof(MotorConfig_t)); // 同步回寫
        }
    }
};

void setupBleServer_Bluedroid() {
    BLEDevice::init(globalHostname.c_str());
    pServer = BLEDevice::createServer();
    pServer->setCallbacks(new MyServerCallbacks());

    // 1. 馬達服務 (控制 + 組態)
    BLEService *pSvcMotor = pServer->createService(MOTOR_SERVICE_UUID);
    pControlCharacteristic = pSvcMotor->createCharacteristic(MOTOR_CONTROL_CHAR_UUID, BLECharacteristic::PROPERTY_WRITE);
    pControlCharacteristic->setCallbacks(new MyCharCallbacks());
    pMotorConfigCharacteristic = pSvcMotor->createCharacteristic(MOTOR_CONFIG_CHAR_UUID, BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_WRITE);
    pMotorConfigCharacteristic->setCallbacks(new MotorConfigCallbacks());
    pMotorConfigCharacteristic->setValue((uint8_t*)&motorConfig, sizeof(MotorConfig_t)); // 預載
    pSvcMotor->start();

    // 2. 設定服務 (WiFi)
    BLEService *pSvcConfig = pServer->createService(CONFIG_SERVICE_UUID);
    pSsidCharacteristic = pSvcConfig->createCharacteristic(SSID_CHAR_UUID, BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_WRITE);
    pSsidCharacteristic->setCallbacks(new WiFiSsidCallbacks());
    pPassCharacteristic = pSvcConfig->createCharacteristic(PASS_CHAR_UUID, BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_WRITE);
    pPassCharacteristic->setCallbacks(new WiFiPassCallbacks());
    
    // 預載 WiFi 設定
    preferences.begin("wifi-config", true);
    pSsidCharacteristic->setValue(preferences.getString("ssid","").c_str());
    pPassCharacteristic->setValue(preferences.getString("pass","").c_str());
    preferences.end();
    
    pSvcConfig->start();

    // [v11] 增加 MTU 支援
    BLEDevice::setMTU(512);

    // 廣播設定優化 (解決 31-byte 限制導致 UUID 遺失問題)
    BLEAdvertising *pAdv = BLEDevice::getAdvertising();
    
    // 優先在主廣告中加入 Config Service，確保配置工具能掃描到
    pAdv->addServiceUUID(CONFIG_SERVICE_UUID);
    
    // 啟用掃描回應 (Scan Response)，並將馬達服務放入其中
    pAdv->setScanResponse(true);
    pAdv->addServiceUUID(MOTOR_SERVICE_UUID); 
    
    pAdv->start();
    Serial.println("🤖 BLE Services (Motor + WiFi Config) Started with optimized advertising (v06).");
}

void onWsEvent(uint8_t num, WStype_t type, uint8_t * payload, size_t length) {
    if (type == WStype_TEXT) {
        char buffer[length + 1];
        memcpy(buffer, payload, length);
        buffer[length] = '\0';
        String msg = String(buffer);
        
        int idx = msg.indexOf(',');
        if (idx > 0) { 
            targetSpeedT = msg.substring(0,idx).toInt(); 
            targetSpeedS = msg.substring(idx+1).toInt(); 
            lastControlTime = millis(); 
            Serial.printf("⚡ WS Control -> T:%d, S:%d\n", targetSpeedT, targetSpeedS);
        }
    }
}

void checkUdpControl() {
    if (udp.parsePacket()) {
        char b[32]; int l = udp.read(b,31); b[l]=0; String msg=String(b);
        int idx = msg.indexOf(',');
        if (idx > 0) { targetSpeedT = msg.substring(0,idx).toInt(); targetSpeedS = msg.substring(idx+1).toInt(); lastControlTime = millis(); }
    }
}

void generateHostname() {    
    globalHostname = "esp32c3-" + WiFi.macAddress(); 
    globalHostname.replace(":", ""); 
    globalHostname.toLowerCase(); 
    Serial.printf("Generated Hostname: %s\n", globalHostname.c_str());
}
void connectToSavedWiFi() {
    preferences.begin("wifi-config", true); String s = preferences.getString("ssid",""); String p = preferences.getString("pass",""); preferences.end();
    if (s.length()>0) { WiFi.mode(WIFI_STA); WiFi.begin(s.c_str(), p.c_str()); }
}

void setup() {
    Serial.begin(115200); loadMotorConfig();
    pinMode(NSLEEP_PIN, OUTPUT); digitalWrite(NSLEEP_PIN, HIGH);
    ledcSetup(LEDC_CH_A1, 20000, 8); ledcSetup(LEDC_CH_A2, 20000, 8);
    ledcSetup(LEDC_CH_B1, 20000, 8); ledcSetup(LEDC_CH_B2, 20000, 8);
    ledcAttachPin(AIN1_PIN, LEDC_CH_A1); ledcAttachPin(AIN2_PIN, LEDC_CH_A2);
    ledcAttachPin(BIN1_PIN, LEDC_CH_B1); ledcAttachPin(BIN2_PIN, LEDC_CH_B2);
    analogReadResolution(12); generateHostname(); setupBleServer_Bluedroid(); connectToSavedWiFi();
}

void loop() {
    if (servicesStarted) {
        webSocket.loop();
        checkUdpControl();
        server.handleClient();
    }
    
    // [v12] 加入串口除錯控制台：輸入 T:255,S:0 即可直接測試馬達
    if (Serial.available()) {
        String input = Serial.readStringUntil('\n');
        input.trim();
        if (input.startsWith("T:")) {
            int comma = input.indexOf(',');
            if (comma > 0) {
                targetSpeedT = input.substring(2, comma).toInt();
                targetSpeedS = input.substring(comma+3).toInt(); // 跳過 S:
                lastControlTime = millis();
                Serial.printf("🛠️ Manual Serial Set -> T:%d, S:%d\n", targetSpeedT, targetSpeedS);
            }
        }
    }

    if (WiFi.status() == WL_CONNECTED && !servicesStarted) {
        MDNS.begin(globalHostname.c_str());
        server.on("/", handleRoot); server.on("/joystick", handleJoystick); server.on("/control", handleControl);
        server.on("/update_factory", handleFactoryUpdate); server.on("/update_github", handleGitHubUpdate);
        server.on("/toggle_auto_update", handleToggleAutoUpdate);
        server.begin(); webSocket.begin(); webSocket.onEvent(onWsEvent); udp.begin(UDP_PORT);
        servicesStarted = true; checkAndPerformAutoUpdate();
    }
    if (!isUpdating) { motorRampTask(); updateBatteryVoltage(); if(millis()-lastControlTime>1000){targetSpeedT=0;targetSpeedS=0;} }
    if (should_restart_advertising && pServer) { pServer->startAdvertising(); should_restart_advertising = false; }
    delay(1);
}
